module.exports = {
  full_old: {
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '1433692090', '{non_bank_2}', '{non_bank_0}', '723847744913400', '1895707264052', '112333', '222231232232','',''
    ]
  },
  full: {
    cell: [
      'A3', 'B3','C3','D3',
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '2568-07-20','14:30','W660419599|H|147817|ตช.0018(นม).(22)/994',
      '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','1433692090','ธนาคารกรุงเทพ จำกัด (มหาชน)','002', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '2568-07-21 14:52','2568-07-21 14:52','2568-07-21 14:52','2568-07-21 14:52','2568-07-21 14:52','ระงับเฉพาะยอดเงิน','500','2000','2568-07-21 14:52','2568-07-21 14:52','หมายอายัดเฉพาะยอดเงินที่ระบุ (Q)','W660419599|R|147817|ตช.0018(นม).(22)/994','500','W660419599|R|147817|ตช.0018(นม).(22)/994',
      '', '', '', '', '', '', '','','',''
    ]
  },
  for_subcase_MBs: {
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','1433692090','ธนาคารกรุงเทพ จำกัด (มหาชน)','002', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '', '', '', '', '','','',''
    ]
  },
  for_subcase_FI: {
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '1433692090', '{non_bank_2}', '{non_bank_0}','', '', '', '', '','',''
    ]
  },
  fix: {
    cell: [
      'A3'
    ],
    valueTemplate: [
      '{bankcaseID}'
    ]
  },
  TC001_001: {
    // bankcaseID same
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '1433692090', '{non_bank_2}', '{non_bank_0}', '723847744913400', '1895707264052', '112333', '222231232232','',''
    ]
  },
  TC001_005: {
    cell: [
      'A3', 
    ],
    valueTemplate: [
      '{bankcaseID}',
    ]
  },
  TC001_006: {
    // bankname same valid filed m1 + m2 + p + o
    cell: [
      'A3', 'B3','C3','D3',
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '2568-07-20','14:30','W660419599|H|147817|ตช.0018(นม).(22)/994',
      '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','1433692090','ธนาคารกรุงเทพ จำกัด (มหาชน)','002', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '2568-07-21 14:52','2568-07-21 14:52','2568-07-21 14:52','2568-07-21 14:52','2568-07-21 14:52','ระงับเฉพาะยอดเงิน','500','2000','2568-07-21 14:52','2568-07-21 14:52','หมายอายัดเฉพาะยอดเงินที่ระบุ (Q)','W660419599|R|147817|ตช.0018(นม).(22)/994','500','W660419599|R|147817|ตช.0018(นม).(22)/994',
      '', '', '', '', '', '', '','','',''
    ]
  },
  TC001_007: {
    // bankname not same valid filed m1 + m2 + p + o
    cell: [
      'A3', 'B3','C3','D3',
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '2568-07-20','14:30','W660419599|H|147817|ตช.0018(นม).(22)/994',
      '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','1433692090','ธนาคารกรุงเทพ จำกัด (มหาชน)','002', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '2568-07-21 14:52','2568-07-21 14:52','2568-07-21 14:52','2568-07-21 14:52','2568-07-21 14:52','ระงับเฉพาะยอดเงิน','500','2000','2568-07-21 14:52','2568-07-21 14:52','หมายอายัดเฉพาะยอดเงินที่ระบุ (Q)','W660419599|R|147817|ตช.0018(นม).(22)/994','500','W660419599|R|147817|ตช.0018(นม).(22)/994',
      '', '', '', '', '', '', '','','',''
    ]
  },
  TC001_008: {
    // valid p 
    cell: [
      'A3', 'B3','C3','D3',
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '2568-07-20','14:30','W660419599|H|147817|ตช.0018(นม).(22)/994',
      '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','1433692090','ธนาคารกรุงเทพ จำกัด (มหาชน)','002', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '', '', '', '', '','','',''
    ]
  },
  TC001_009: {
    cell: [
      'A3', 'B3','C3','D3','E3',
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '', '2568-07-20','14:30','W660419599|H|147817|ตช.0018(นม).(22)/994','',
      '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','1433692090','ธนาคารกรุงเทพ จำกัด (มหาชน)','002', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '', '', '', '', '','','',''
    ]
  },
  TC001_010: {
    cell: [
      'A3', 'B3','C3','D3',
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '2568-07-20','14:30','W660419599|H|147817|ตช.0018(นม).(22)/994',
      '', '', '', '', '', '',
      '', '', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','1433692090','ธนาคารกรุงเทพ จำกัด (มหาชน)','002', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '', '', '', '', '','','',''
    ]
  },
  TC001_011: {
    cell: [
      'A3', 'B3','C3','D3',
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '2568-07-20','14:30','W660419599|H|147817|ตช.0018(นม).(22)/994',
      '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      '', '', '', '', '', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','1433692090','ธนาคารกรุงเทพ จำกัด (มหาชน)','002', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '2568-07-21 14:52','2568-07-21 14:52','2568-07-21 14:52','2568-07-21 14:52','2568-07-21 14:52','ระงับเฉพาะยอดเงิน','500','2000','2568-07-21 14:52','2568-07-21 14:52','หมายอายัดเฉพาะยอดเงินที่ระบุ (Q)','W660419599|R|147817|ตช.0018(นม).(22)/994','500','W660419599|R|147817|ตช.0018(นม).(22)/994',
      '', '', '', '', '', '', '','','',''
    ]
  },
  TC001_012: {
    cell: [
      'A3', 'B3','C3','D3',
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '2568-07-20','14:30','W660419599|H|147817|ตช.0018(นม).(22)/994',
      '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '', '', '', '','','','','', '', '', '', '',
      '','','','','','','','','','','','','','',
      '', '', '', '', '', '', '','','',''
    ]
  },
  TC001_013: {
    // blank non_bank เลขบัญีชื่อผู้ต้องสงสัย
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '{non_bank_2}', '{non_bank_0}', '', '', '', '','',''
    ]
  },
  TC001_014: {
    // blank settlement
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '{non_bank_2}', '{non_bank_0}','', '', '', '', '','',''
    ]
  },
  TC001_015: {
    // blank refcode1,2,3 and have value billerID
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '1433692090', '{non_bank_2}', '{non_bank_0}','BBL:8592274900', '010556416158091', '', '', '','',''
    ]
  },
  TC001_016: {
    // blank refcode2
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '1433692090', '{non_bank_2}', '{non_bank_0}','BBL:8592274901', '723847744913400', '1895707264052', '', '222231232232','',''
    ]
  },
  TC001_017: {
    // blank refcode3
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '1433692090', '{non_bank_2}', '{non_bank_0}','BBL:8592274901', '723847744913400', '1895707264052', '222231232232', '','',''
    ]
  },
  TC001_018: {
    // blank เส้นการเงิน
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '1433692090', '{non_bank_2}', '{non_bank_0}','BBL:8592274903', '010556416158091', '1895707264052', '222231232232', '112333','','ทดสอบTest!@$%<=#'
    ]
  },
  TC001_019: {
    // blank เหตุผลสถานะการเงิน
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '1433692090', '{non_bank_2}', '{non_bank_0}','BBL:8592274901', '723847744913400', '1895707264052', '222231232232', '112333','การทำธุรกรรมไปต่างประเทศ',''
    ]
  },
  TC001_020: {
    cell: [
      'A3', 'E3',
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '25680717KUU000111','ผู้เสียหายแจ้งเอง มาตรา 100', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '', '', '', '', '','','',''
    ]
  },
  TC001_021: {
    cell: [
      'A3',
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '9912039228132||', 'บุคคลตัวอย่าง', 'ธ||ทน', 'ทน|แล้ว', 'ข่มขู่จิตใจ', '4405249967',
      'ITXM', '0A2', '09@#001', 'ทน|อีก', '09@BBA#002', 'OF||@GUM.GUU', 'เจ้าชีวิต',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '', '', '', '', '','','',''
    ]
  },
  TC001_022: {
    cell: [
      'A3',
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'ธ||ทน', 'ทน|แล้ว', 'ทดสอบTest!@$%<=#', 'ITXM', '0A2', '192|168|01|', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '', '', '', '', '','','',''
    ]
  },
  TC001_023: {
    cell: [
      'A3',
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '9928172632944', 'บุคคลแสนดี',
      '09XF@||', 'อยู่|ทำไม', 'ไป|สะ', 'มีหรือไม่','00AX|O@','ทดสอบTest!@$%<=#','ITMX','902', '2568/05/05', '10|00|00', 'Pi|pe|Tae', 'S11.91',
      '','','','2568/05/05 09|29','2568-12-32 10:10|','ระงับอารมณ์','๙๙.๑๑','-01.00|','2568-12-31 24|55','2499-12-31 15:55|','หมายลุงยัด','@@ลุงยัด๑๑๑','19|00','ปลด@นะย๊ะ@',
      '', '', '', '', '', '', '','','',''
    ]
  },
  TC001_024: {
    // invalid blier
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      'ทดสอบTest!@$%<=#', '{non_bank_2}', '{non_bank_0}','BBL:8592274901', '723847744913400', '1895707264052', '', '','',''
    ]
  },
  TC001_025: {
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '0118273015', '{non_bank_2}', '{non_bank_0}','BBL;9412832271', '010556416158091', '922BIS029183', '', '','',''
    ]
  },
  TC001_026: {
    // valid blier
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '1433692090', '{non_bank_2}', '{non_bank_0}','BBL:8592274901', '723847744913400', '1895707264052', '', '','',''
    ]
  },
  TC001_027: {
    // blank refcode 2,3 and have value billerID , ref1
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '1433692090', '{non_bank_2}', '{non_bank_0}','BBL:8592274901', 'Testทดสอบค่ะทดส', '1895707264052', '', '','',''
    ]
  },
  TC001_028: {
    // blank refcode 2,3 and have value billerID , ref1
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '1433692090', '{non_bank_2}', '{non_bank_0}','BBL:8592274901', '723847744913400', '||||||||||||||||||||', '', '','',''
    ]
  },
  TC001_029: {
    // blank refcode 3 and have value billerID , ref1 , 2
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '1433692090', '{non_bank_2}', '{non_bank_0}','BBL:8592274901', '723847744913400', 'maxnum007', '||||||||||||||||||||', '','',''
    ]
  },
  TC001_030: {
    // blank refcode 2 and have value billerID , ref1 , 3
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '1433692090', '{non_bank_2}', '{non_bank_0}','BBL:8592274901', '723847744913400', 'maxnum007', '', '||||||||||||||||||||','',''
    ]
  },
  TC001_031: {
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '0118273015', '{non_bank_2}', '{non_bank_0}','BBL:8592274908', '723847744913400', 'Osuao229183', '', '','','||||||||||'
    ]
  },
  TC001_032: {
    // bankcaseID 15 digi
    cell: [
      'A3', 'B3','C3','D3',
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '25680717CMBT001234', '2568-07-20','14:30','W660419599|H|147817|ตช.0018(นม).(22)/994',
      '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','1433692090','ธนาคารกรุงเทพ จำกัด (มหาชน)','002', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '2568-07-21 14:52','2568-07-21 14:52','2568-07-21 14:52','2568-07-21 14:52','2568-07-21 14:52','ระงับเฉพาะยอดเงิน','500','2000','2568-07-21 14:52','2568-07-21 14:52','หมายอายัดเฉพาะยอดเงินที่ระบุ (Q)','W660419599|R|147817|ตช.0018(นม).(22)/994','500','W660419599|R|147817|ตช.0018(นม).(22)/994',
      '', '', '', '', '', '', '','','',''
    ]
  },
  TC001_033: {
    cell: [
      'A3', 'B3','C3','D3',
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '2568-07-20','14:30','W660419599|H|147817|ตช.0018(นม).(22)/994',
      'OSIX283soXCsdiwe18283hsjfdjSJCJDFDHE', 'ชาวต่างชาติ', 'TalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTa', 'MongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkon', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '23912730192839210',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907151531,0907151532,0907151533,090', 'AppleAppleAppleAppleAppleAppleAppleAppleAppleAppleAppleAppleAppleAppleAppleAppleAppleAppleAppleAppleAppleAppleAppleAppleAppleAppleAppleAppleAppleAppleAppleAppleAppleAppleAppleAppleAppleAppleAppleAppleAppleAppleAppleAppleAppleAppleAppleAppleAppleAppleApplePP', '0907011721', 'Test123412341234123412341234123412341234123412341234123412341234123412341234123412341234123412341234123412341234123412341234123412341234123412341234123412341234123412341234123412341234123412341234123412341234123412341234123412341234123412341234123@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','1433692090','ธนาคารกรุงเทพ จำกัด (มหาชน)','002', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '2568-07-21 14:52','2568-07-21 14:52','2568-07-21 14:52','2568-07-21 14:52','2568-07-21 14:52','ระงับเฉพาะยอดเงิน','500','2000','2568-07-21 14:52','2568-07-21 14:52','หมายอายัดเฉพาะยอดเงินที่ระบุ (Q)','W660419599|R|147817|ตช.0018(นม).(22)/994','500','W660419599|R|147817|ตช.0018(นม).(22)/994',
      '', '', '', '', '', '', '','','',''
    ]
  },
  TC001_034: {
    cell: [
      'A3', 'B3','C3','D3',
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '2568-07-20','14:30','W660419599|H|147817|ตช.0018(นม).(22)/994',
      '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'TalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTalayTa', 'MongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkonjitMongkon', '59182739102938200', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '4444', '192.168.1.22222222222222222222222222222222222222222', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','1433692090','ธนาคารกรุงเทพ จำกัด (มหาชน)','002', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '2568-07-21 14:52','2568-07-21 14:52','2568-07-21 14:52','2568-07-21 14:52','2568-07-21 14:52','ระงับเฉพาะยอดเงิน','500','2000','2568-07-21 14:52','2568-07-21 14:52','หมายอายัดเฉพาะยอดเงินที่ระบุ (Q)','W660419599|R|147817|ตช.0018(นม).(22)/994','500','W660419599|R|147817|ตช.0018(นม).(22)/994',
      '', '', '', '', '', '', '','','',''
    ]
  },
  TC001_035: {
    cell: [
      'A3', 'B3','C3','D3',
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '2568-07-20','14:30','W660419599|H|147817|ตช.0018(นม).(22)/994',
      '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '5519217980516ItthipolJittaworawetch1', 'ชาวต่างชาติ',
      '0907151543,0907151544,0907151545,090', 'YasitaYasitaYasitaYasitaYasitaYasitaYasitaYasitaYasitaYasitaYasitaYasitaYasitaYasitaYasitaYasitaYasitaYasitaYasitaYasitaYasitaYasitaYasitaYasitaYasitaYasitaYasitaYasitaYasitaYasitaYasitaYasitaYasitaYasitaYasitaYasitaYasitaYasitaYasitaYasitaYasitaYasitaYasit', 'JeerawongsaJeerawongsaJeerawongsaJeerawongsaJeerawongsaJeerawongsaJeerawongsaJeerawongsaJeerawongsaJeerawongsaJeerawongsaJeerawongsaJeerawongsaJeerawongsaJeerawongsaJeerawongsaJeerawongsaJeerawongsaJeerawongsaJeerawongsaJeerawongsaJeerawongsaJeerawongsaJeer', 'e-wallet','1409283019283921','069283748192839201','ธนาคารกรุงเทพ จำกัด (มหาชน)','002', '2568-06-01', '10:00:00', 'PipeTaePipeTaePipeTaePipeTaePipeTaeP', '99999999999999999.99',
      '','','','2568-06-30 14:39','2568-06-30 14:39','ระงับเฉพาะยอดเงิน','99999999999999999.99','99999999999999999.99','2568-06-30 14:39','2568-06-30 14:39','หมายอายัดเฉพาะยอดเงินที่ระบุ (Q)',`JJskdfkasdkjaskdjaklsjflksajkfsjrlgjsdig||||sadjaopfjasljglkdsfjglserjglkdsfjlksjlfijawoieiaowe41312lkejlk;fsdf'sdgkldskflgdlflgi`,'99999999999999999.99',`JJsk1234sdkjaskdjaklsjflksajkfsjrlgjsdig||||sadjaopfjasljglkdsfjglserjglkdsfjlksjlfijawoieiaowe41312lkejlk;fsdf'sdgkldskflgdlflgi`,
      '', '', '', 'BBL:8592274908', '', '', '','','',''
    ]
  },
  TC001_036: {
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '950293829102938219502938291029382195029382910293821123', '{non_bank_2}', '{non_bank_0}', 'BBL:8592274908', '010556416158091', '922BIS029183', 'SOIW9912451','owwpSGI2312','การทำธุรกรรมไปต่างประเทศ',''
    ]
  },
  TC001_037: {
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '1029140291', '{non_bank_2}', '{non_bank_0}', 'BBL:1992319273812573245819273981273891724891728397128731984981273', '010556416158091', '922BIS029183', 'SOIW9912451','owwpSGI2312','การทำธุรกรรมไปต่างประเทศ',''
    ]
  },
  TC001_038: {
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '1029140291', '{non_bank_2}', '{non_bank_0}', 'BBL:8592274908', '0105564161580911', '922BIS029183', 'SOIW9912451','owwpSGI2312','การทำธุรกรรมไปต่างประเทศ',''
    ]
  },
  TC001_039: {
    // invalid billerID format , length less 15 digi 
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '1433692090', '{non_bank_2}', '{non_bank_0}','BBL:8592274909', '01055641615809', 'maxnum007', 'maxnum008', 'maxnum009', 'การทำธุรกรรมไปต่างประเทศ',''
    ]
  },
  TC001_040: {
    //  invalid ref1  more 20 digi
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '1433692090', '{non_bank_2}', '{non_bank_0}','', '010556416158090', `Teทด~!_+=-]}:;/?.<,""'`, 'maxnum008', 'maxnum009', 'การทำธุรกรรมไปต่างประเทศ',''
    ]
  },
  TC001_041: {
    //  invalid ref2  more 20 digi
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '1433692090', '{non_bank_2}', '{non_bank_0}','', '010556416158090', 'maxnum008',`Teทด~!_+=-]}:;/?.<,""'`, 'maxnum009', 'การทำธุรกรรมไปต่างประเทศ',''
    ]
  },
  TC001_042: {
    //  invalid ref3  more 20 digi
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '1433692090', '{non_bank_2}', '{non_bank_0}','', '010556416158090', 'maxnum008','maxnum009',`Teทด~!_+=-]}:;/?.<,""'`, 'การทำธุรกรรมไปต่างประเทศ',''
    ]
  },
  TC001_043: {
    //  invalid ref3  more 20 digi and สถานะเส้นการเงินเป็น 256 digi
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '1433692090', '{non_bank_2}', '{non_bank_0}','', '010556416158090', 'maxnum008','maxnum009','maxnum001', '',`~ !@#$%^&*()_+=-\][{}:;/?.><,"':~ !@#$%^&*()_+=-\][{}:;/?.><,"':~ !@#$%^&*()_+23759287592375252525529385029523759287592375252525529385029523759287592375252525529385029523759287592375252525529385025529385029523759287592375252525529384252525529385029523746368 Branch: ~ !@#$%^&*()_+=-\][{}:;/?.><,"':~ !@#$%^&*()_+=-\][{}:;/?.><,"':~ !@#$%^&*()_+=-\][{}:;/?.><,"':~ !@#$%^&*()_+=-\][{}:;/?.><,"'ธ่หกรหดาำยหาดรนหสา่ดนหดสห่ดหน่ดUUJDLIJFWlsckslmfsokf;lsaokdpoalmfjpoafjaoifhaihfaikfdhaiufaiudiuafiaofuoeifupsdi09afipofkap0fsfji:`
    ]
  },
  TC001_044: {
    // invalid format blank m1 bankcode
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','1433692090','ธนาคารกรุงเทพ จำกัด (มหาชน)','002', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '', '', '', '', '','','',''
    ]
  },
  TC001_045: {
    // invalid format blank m1 bankname
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      '', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','1433692090','ธนาคารกรุงเทพ จำกัด (มหาชน)','002', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '', '', '', '', '','','',''
    ]
  },
  TC001_046: {
    // invalid format input m1 bankcode : 888
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '888', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','1433692090','ธนาคารกรุงเทพ จำกัด (มหาชน)','002', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '', '', '', '', '','','',''
    ]
  },
  TC001_047: {
    // invalid format input m1 bankname : บริษัท คาร์ด เอกซ์ จำกัด
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'บริษัท คาร์ด เอกซ์ จำกัด', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','1433692090','ธนาคารกรุงเทพ จำกัด (มหาชน)','002', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '', '', '', '', '','','',''
    ]
  },
  TC001_048: {
    // invalid format input m1 bankname : บริษัท คาร์ด เอกซ์ จำกัด and bankcode : 888
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'บริษัท คาร์ด เอกซ์ จำกัด', '888', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','1433692090','ธนาคารกรุงเทพ จำกัด (มหาชน)','002', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '', '', '', '', '','','',''
    ]
  },
  TC001_049: {
    // valid format blank m2 bankcode
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','1433692090','ธนาคารกรุงเทพ จำกัด (มหาชน)','002', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '', '', '', '', '','','',''
    ]
  },
  TC001_050: {
    // valid format blank m2 bankname
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', '', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','1433692090','ธนาคารกรุงเทพ จำกัด (มหาชน)','002', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '', '', '', '', '','','',''
    ]
  },
  TC001_051: {
    // valid format input m2 bankcode : 888
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '888', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','1433692090','ธนาคารกรุงเทพ จำกัด (มหาชน)','002', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '', '', '', '', '','','',''
    ]
  },
  TC001_052: {
    // valid format input m2 bankname : บริษัท คาร์ด เอกซ์ จำกัด
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'บริษัท คาร์ด เอกซ์ จำกัด', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','1433692090','ธนาคารกรุงเทพ จำกัด (มหาชน)','002', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '', '', '', '', '','','',''
    ]
  },
  TC001_053: {
    // valid format input m2 bankname : บริษัท คาร์ด เอกซ์ จำกัด
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'บริษัท คาร์ด เอกซ์ จำกัด', '888', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','1433692090','ธนาคารกรุงเทพ จำกัด (มหาชน)','002', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '', '', '', '', '','','',''
    ]
  },
  TC001_054: {
    // blank ข้อมูล trasiotion bankcode
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','1433692090','ธนาคารกรุงเทพ จำกัด (มหาชน)','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '', '', '', '', '','','',''
    ]
  },
  TC001_055: {
    // blank ข้อมูล m2 bankname
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','1433692090','','002', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '', '', '', '', '','','',''
    ]
  },
  TC001_056: {
    // blank ข้อมูล m2 bankcode : 888
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','1433692090','ธนาคารกรุงเทพ จำกัด (มหาชน)','888', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '', '', '', '', '','','',''
    ]
  },
  TC001_057: {
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','1433692090','บริษัท คาร์ด เอกซ์ จำกัด','002', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '', '', '', '', '','','',''
    ]
  },
  TC001_058: {
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','1433692090','บริษัท คาร์ด เอกซ์ จำกัด','888', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '', '', '', '', '','','',''
    ]
  },
  TC001_059: {
    // blank ข้อมูล ผู้ให้บริการทางการเงิน , เลขผู้ต้องสงสัย 
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '0218372119', '{non_bank_2}', '','', '723847744913400', '1895707264052', '', '','',''
    ]
  },
  TC001_060: {
    // blank ข้อมูล fi_code
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '1433692090','{non_bank_2}', '','', '723847744913400', '1895707264052', '', '','',''
    ]
  },
  TC001_061: {
    // blank ข้อมูล fi_code : 888 
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '1433692090', '{non_bank_2}', '888','', '723847744913400', '1895707264052', '', '','',''
    ]
  },
  TC001_062: {
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '1433692090', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '{non_bank_0}','', '010556416158019', '0129382749182', '', '','',''
    ]
  },
  TC001_063: {
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '1433692090', 'ธนาคาร ไอทีเอ็มเอ็กซ์ จำกัด', '888','', '010556416158019', '0129382749182', '', '','',''
    ]
  },
  TC001_064: {
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'e-wallet','140443678914356','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '','CIMBT:1950293821', '', '', '', '','',''
    ]
  },
  TC001_065: {
    // valid ข้อมูล billerID ที่มี master data and blank invalid_o_accountnumber
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '{non_bank_2}', '{non_bank_0}','', '010556416158061', '1895707264052', '', '','',''
    ]
  },
  TC001_066: {
    // valid ข้อมูล billerID ที่มี master data
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '1433692090', '{non_bank_2}', '{non_bank_0}','', '723847744913400', '1895707264052', '', '','',''
    ]
  },
  TC001_067: {
    // valid ข้อมูล billerID ที่มี master data - เหตุผลของการเปลี่ยนสถานะเส้นเงิน : ยอดการระงับได้มากกว่าหรือเท่ากับยอดที่โอนมา and blank สถานะการเงิน
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '1433692090', '{non_bank_2}', '{non_bank_0}','', '723847744913400', '1895707264052', '', '','ยอดการระงับได้มากกว่าหรือเท่ากับยอดที่โอนมา',''
    ]
  },
  TC001_068: {
    // valid ข้อมูล billerID ที่มี master data - เหตุผลของการเปลี่ยนสถานะเส้นเงิน : ชำระด้วยบัตรผ่าน Card Scheme and blank สถานะการเงิน
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '1433692090', '{non_bank_2}', '{non_bank_0}','', '010556416158087', '2938210293281', '', '','ชำระด้วยบัตรผ่าน Card Scheme',''
    ]
  },
  TC001_069: {
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '','', '', '', '', '','ชำระด้วยบัตรผ่าน Card Scheme',''
    ]
  },
  TC001_070: {
    // m2 have value and ข้อมูลสำหรับการหยุดไล่เส้นเงิน and blank สถานะการเงิน
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','1433692090','ธนาคารกสิกรไทย จำกัด (มหาชน)','004', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '','', '', '', '', '','ชำระด้วยบัตรผ่าน Card Scheme',''
    ]
  },
  TC001_071: {
    // m2 have value and non-bank filed blank : accountnumber,shortname,fi_code 
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','1433692090','ธนาคารกสิกรไทย จำกัด (มหาชน)','004', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '', '', '', '', '','',''
    ]
  },
  TC001_072: {
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'e-wallet','140398593859354','1453589356','ธนาคารกรุงเทพ จำกัด (มหาชน)','002', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '1433692090', '{non_bank_2}', '{non_bank_0}', 'BBL:1234567890','', '', '', '','',''
    ]
  },
  TC001_073: {
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '1433692090', '{non_bank_2}', '{non_bank_0}', '','010556117767145', '2938210293281', '', '','',''
    ]
  },
  TC001_074: {
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '1433692090', '{non_bank_2}', '{non_bank_0}', '','010556505535009', '', '2938210293288', '2938210293289','',''
    ]
  },
  TC001_075: {
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '', '', '', '', '','','',''
    ]
  },
  TC001_076: {
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'เบอร์โทร','+66814567890','1453589321','ธนาคารกรุงเทพ จำกัด (มหาชน)','002', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '1333589321', '{non_bank_2}','{non_bank_0}', '', '010554614953133', '334RT33', '','','',''
    ]
  },
  TC001_077: {
    // m2 have value and blank filed : bliierID | promppay : เบอร์โทร
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'เบอร์โทร','+66987654567','1433692090','ธนาคารกสิกรไทย จำกัด (มหาชน)','004', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '', '', '', '', '','',''
    ]
  },
  TC001_078: {
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'หมายเลขบัตรประชาชน','5149418900556','1433692090','ธนาคารกสิกรไทย จำกัด (มหาชน)','004', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '', '', '010555801718954', 'BILL1234567441', '','',''
    ]
  },
  TC001_079: {
    // m2 have value | promppay : หมายเลขบัตรประชาชน
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'หมายเลขบัตรประชาชน','1649084168693','1433692090','ธนาคารกสิกรไทย จำกัด (มหาชน)','004', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '', '', '', '', '','',''
    ]
  },
  TC001_080: {
    // m2 have value type : e-waller (have query valid with shortname : TMN)
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'e-wallet','140367490195616','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '', 'BBL:1234567890', '', '', '','','',''
    ]
  },
  TC001_081: {
    // m2 have value type : e-waller ,  receiver_non_bank
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'e-wallet','140367490195616','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '2739915123','{non_bank_2}','{non_bank_0}', 'BBL:0059294921', '', '', '','','',''
    ]
  },
  TC001_082: {
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'e-wallet','140121219538317','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '2739915123','','', 'BBL:0059294921', '', '', '','','',''
    ]
  },
  TC001_083: {
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'e-wallet','140121219538317','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '2739915123','บริษัท ทรู มันนี่ จำกัด','919', 'BBL:0059294921', '010554614953165', '53535689907', '','','',''
    ]
  },
  TC001_084: {
    // o เหตุผลเส้นการเงิน : ถอนเงินสดผ่านเอทีเอ็ม
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '','','', '','','', '', '','ถอนเงินสดผ่านเอทีเอ็ม',''
    ]
  },
  TC001_085: {
    // o เหตุผลเส้นการเงิน : ถอนเงินสดที่สาขา
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '','','','', '', '', '', '','ถอนเงินสดที่สาขา',''
    ]
  },
  TC001_086: {
    // o เหตุผลเส้นการเงิน : สินทรัพย์ดิจิตอลถูกส่งไปยังปลายทางที่ไม่ทราบผู้ให้บริการ 
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '','','', '','', '', '', '','สินทรัพย์ดิจิตอลถูกส่งไปยังปลายทางที่ไม่ทราบผู้ให้บริการ (Private Wallet)',''
    ]
  },
  TC001_087: {
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','2086801228','ธนาคารกรุงเทพ จำกัด (มหาชน)','002', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '','','', '','', '', '', '','ถอนเงินสดผ่านเอทีเอ็ม',''
    ]
  },
  TC001_088: {
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '0011928321','บริษัท ทรู มันนี่ จำกัด','919', '','', '', '', '','ถอนเงินสดที่สาขา',''
    ]
  },
  TC001_089: {
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14'
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '0011928321','บริษัท ทรู มันนี่ จำกัด','919', '','', '', '', '','สินทรัพย์ดิจิตอลถูกส่งไปยังปลายทางที่ไม่ทราบผู้ให้บริการ (Private Wallet)',''
    ]
  },
  TC001_090: {
    // m2 have promppay type : e-waller and o all blank have value settlement (bank)
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14  '
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'e-wallet','004367897654321','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '', 'BBL:0059294921', '', '', '','','',''
    ]
  },
  TC001_091: {
    // m2 have promppay type : e-waller and o all blank have value settlement (non-bank)
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14  '
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'e-wallet','340481712926383','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '', 'BBL:0059294921', '', '', '','','',''
    ]
  },
  TC001_092: {
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14  '
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','1086801229','ธนาคารกรุงเทพ จำกัด (มหาชน)','002', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '', '', '885909876567866', '5117713926143', '','','',''
    ]
  },
  TC001_093: {
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14  '
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '', '', '010555206135623', 'ABC-12345', '','','',''
    ]
  },
  TC001_094: {
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14  '
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'e-wallet','357839735733834','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '{non_bank_2}', '{non_bank_0}', 'BBL:0059294921', '', '', '','','',''
    ]
  },
  TC001_095: {
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14  '
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'e-wallet','140001922839218','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '5284410455', '', '', 'BBL:9110029312', '', '', '','','',''
    ]
  },
  TC001_096: {
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14  '
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '4550938475', '{non_bank_2}', '{non_bank_0}', '', '111222333444555', 'ABC-12345', '','','',''
    ]
  },
  TC001_097: {
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14  '
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '', '', '119228301928329', '1846787606347', '','','',''
    ]
  },
  TC001_098: {
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14  '
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '', '', '398972857373848', '1518672046893', '','','',''
    ]
  },
  TC001_099: {
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14  '
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '{non_bank_2}', '{non_bank_0}', '', '010556505535061', '9990007865421', '','','',''
    ]
  },
  TC001_100: {
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14  '
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'ไม่มี','','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '{non_bank_2}', '{non_bank_0}', '', '134102749920700', '9990007865421', '','','',''
    ]
  },
  TC001_101: {
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14  '
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'e-wallet','140951220391234','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '', '', '', '', '','','',''
    ]
  },
  TC001_102: {
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14  '
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'e-wallet','140928338201923','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '', 'BBL:9110029312', '', '922BIS029183', '','','',''
    ]
  },
  TC001_103: {
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14  '
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'e-wallet','140968455029386','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '', 'BBL:9110029312', '', '', '','','',''
    ]
  },
  TC001_104: {
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14  '
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'e-wallet','140229388103921','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '', 'BBL:9110029312', '013555400922061', '1102209485273', '','','',''
    ]
  },
  TC001_105: {
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14  '
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'e-wallet','140968455029386','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '', 'BBL:9110029312', '013555400922061', '', '','','',''
    ]
  },
  TC001_106: {
    cell: [
      'A3', 
      'A9', 'B9', 'C9', 'D9', 'E9', 'G9', 'H9', 'I9', 'J9', 'K9', 'L9', 'M9', 'N9',
      'B14', 'C14', 'D14', 'E14', 'F14', 'G14', 'H14', 'I14', 'J14', 'K14', 'L14', 'M14','N14','O14','P14','Q14', 'R14', 'S14', 'T14', 'U14',
      'V14', 'W14', 'X14', 'Y14', 'Z14', 'AA14', 'AB14', 'AC14', 'AD14', 'AE14', 'AF14', 'AG14', 'AH14','AI14',
      'AJ14', 'AK14', 'AL14', 'AM14', 'AN14', 'AO14', 'AP14', 'AQ14', 'AR14','AS14  '
    ],
    valueTemplate: [
      '{bankcaseID}', '{id}', 'บุคคลธรรมดา', 'มาแก้', 'ได้ไหมล่ะ', 'ข่มขู่ทางโทรศัพท์ให้เกิดความกลัวแล้วหลอกให้โอนเงิน', '4405249967',
      'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '0907011722', 'max mana', '0907011721', 'max@gmail.com', 'บุตร',
      'มาแก้', 'ได้ไหมล่ะ', '4405249967', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '111', '2749233250199', 'บุคคลธรรมดา',
      '0907011723', 'สุทธิพงษ์', 'นันทวัฒน์', 'e-wallet','140928338201923','','','', '2568-06-01', '10:00:00', 'ttt', '10.00',
      '','','','','','','','','','','','','','',
      '', '', '', 'BBL:9110029312', '', 'BILL2345678904', '','','',''
    ]
  },


};