module.exports = {
  full: {
    cell: [
    'A3', 
    'A7','B7', 'C7', 'D7', 'E7', 'F7', 'G7', 'H7', 'I7', 'J7', 'K7', 'L7', 'M7','N7','O7','P7','Q7', 'R7', 'S7', 'T7', 'U7','V7',
    'W7','X7','Y7',
    'B12', 'C12', 'D12', 'E12', 'F12', 'G12', 'H12', 'I12', 'J12', 'K12', 'L12', 'M12','N12','O12','P12','Q12', 'R12', 'S12', 'T12', 'U12',
    'V12', 'W12', 'X12', 'Y12', 'Z12', 'AA12', 'AB12', 'AC12', 'AD12', 'AE12', 'AF12',
    'AJ12', 'AK12', 'AL12', 'AM12', 'AN12', 'AO12', 'AP12', 'AQ12', 'AR12','AS12'
    ],
    valueTemplate: [
    '{bankcaseID}',
    '{personalID}', '{personalType}', '{name}', '{lname}', '{AccountNumber_non_bank}', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '{AccountNumber_non_bank}','{non_bank_2}', '{non_bank_0}',
    '{name}', '{lname}', '{AccountNumber_non_bank}', '{non_bank_2}', '{non_bank_0}', '', '', '',
    '', 'อาซิ่ง', 'ยอดเซียน', 'ไม่มี', '', '', '', '', '2568-06-11', '10:00:00', 'hhh', '10.00',
    '', '', '', '', '', '', '', '', '', '', '',
    '1433693090', '{non_bank_2}', '{non_bank_0}', '', '', '', '', '','',''
    ]
  },
  TC003_006: {
    cell: [
    'A3', 
    'A7','B7', 'C7', 'D7', 'E7', 'F7', 'G7', 'H7', 'I7', 'J7', 'K7', 'L7', 'M7','N7','O7','P7','Q7', 'R7', 'S7', 'T7', 'U7','V7',
    'W7','X7','Y7',
    'B12', 'C12', 'D12', 'E12', 'F12', 'G12', 'H12', 'I12', 'J12', 'K12', 'L12', 'M12','N12','O12','P12','Q12', 'R12', 'S12', 'T12', 'U12',
    'V12', 'W12', 'X12', 'Y12', 'Z12', 'AA12', 'AB12', 'AC12', 'AD12', 'AE12', 'AF12',
    'AJ12', 'AK12', 'AL12', 'AM12', 'AN12', 'AO12', 'AP12', 'AQ12', 'AR12','AS12'
    ],
    valueTemplate: [
    '{bankcaseID}',
    '{personalID}', '{personalType}', '{name}', '{lname}', '{AccountNumber_non_bank}', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '{AccountNumber_non_bank}','{non_bank_2}', '{non_bank_0}',
    '{name}', '{lname}', '{AccountNumber_non_bank}', '{non_bank_2}', '{non_bank_0}', '', '', '',
    '', 'อาซิ่ง', 'ยอดเซียน', 'ไม่มี', '', '', '', '', '2568-06-11', '10:00:00', 'hhh', '10.00',
    '', '', '', '', '', '', '', '', '', '', '',
    '1433693090', '{non_bank_2}', '{non_bank_0}', '', '', '', '', '','',''
    ]
  },
  TC003_007: {
    cell: [
    'A3', 
    'A7','B7', 'C7', 'D7', 'E7', 'F7', 'G7', 'H7', 'I7', 'J7', 'K7', 'L7', 'M7','N7','O7','P7','Q7', 'R7', 'S7', 'T7', 'U7','V7',
    'W7','X7','Y7',
    'B12', 'C12', 'D12', 'E12', 'F12', 'G12', 'H12', 'I12', 'J12', 'K12', 'L12', 'M12','N12','O12','P12','Q12', 'R12', 'S12', 'T12', 'U12',
    'V12', 'W12', 'X12', 'Y12', 'Z12', 'AA12', 'AB12', 'AC12', 'AD12', 'AE12', 'AF12',
    'AJ12', 'AK12', 'AL12', 'AM12', 'AN12', 'AO12', 'AP12', 'AQ12', 'AR12','AS12'
    ],
    valueTemplate: [
    '{bankcaseID}',
    '{personalID}', '{personalType}', '{name}', '{lname}', '{AccountNumber_non_bank}', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '{AccountNumber_non_bank}','{non_bank_2}', '{non_bank_0}',
    '{name}', '{lname}', '{AccountNumber_non_bank}', '{non_bank_2}', '{non_bank_0}', '', '', '',
    '', 'อาซิ่ง', 'ยอดเซียน', 'ไม่มี', '', '', '', '', '2568-06-11', '10:00:00', 'hhh', '10.00',
    '', '', '', '', '', '', '', '', '', '', '',
    '1433693090', 'บริษัท ช้อปปี้เพย์ (ประเทศไทย) จำกัด', '303', '', '', '', '', '','',''
    ]
  },
  TC003_016: {
    cell: [
    'A3', 
    'A7','B7', 'C7', 'D7', 'E7', 'F7', 'G7', 'H7', 'I7', 'J7', 'K7', 'L7', 'M7','N7','O7','P7','Q7', 'R7', 'S7', 'T7', 'U7','V7',
    'W7','X7','Y7',
    'B12', 'C12', 'D12', 'E12', 'F12', 'G12', 'H12', 'I12', 'J12', 'K12', 'L12', 'M12','N12','O12','P12','Q12', 'R12', 'S12', 'T12', 'U12',
    'V12', 'W12', 'X12', 'Y12', 'Z12', 'AA12', 'AB12', 'AC12', 'AD12', 'AE12', 'AF12',
    'AJ12', 'AK12', 'AL12', 'AM12', 'AN12', 'AO12', 'AP12', 'AQ12', 'AR12','AS12'
    ],
    valueTemplate: [
    '{bankcaseID}',
    '{personalID}', '{personalType}', '{name}', '{lname}', '{AccountNumber_non_bank}', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '{AccountNumber_non_bank}','{non_bank_2}', '{non_bank_0}',
    '{name}', '{lname}', '{AccountNumber_non_bank}', '{non_bank_2}', '{non_bank_0}', '', '', '',
    '', 'อาซิ่ง', 'ยอดเซียน', 'ไม่มี', '', '', '', '', '2568-06-11', '10:00:00', 'hhh', '10.00',
    '', '', '', '', '', '', '', '', '', '', '',
    '1433693090', 'บริษัท ช้อปปี้เพย์ (ประเทศไทย) จำกัด', '303', '', '010556416158091', '922BIS029183', '', '922BIS025513','',''
    ]
  },
  TC003_017: {
    cell: [
    'A3', 
    'A7','B7', 'C7', 'D7', 'E7', 'F7', 'G7', 'H7', 'I7', 'J7', 'K7', 'L7', 'M7','N7','O7','P7','Q7', 'R7', 'S7', 'T7', 'U7','V7',
    'W7','X7','Y7',
    'B12', 'C12', 'D12', 'E12', 'F12', 'G12', 'H12', 'I12', 'J12', 'K12', 'L12', 'M12','N12','O12','P12','Q12', 'R12', 'S12', 'T12', 'U12',
    'V12', 'W12', 'X12', 'Y12', 'Z12', 'AA12', 'AB12', 'AC12', 'AD12', 'AE12', 'AF12',
    'AJ12', 'AK12', 'AL12', 'AM12', 'AN12', 'AO12', 'AP12', 'AQ12', 'AR12','AS12'
    ],
    valueTemplate: [
    '{bankcaseID}',
    '{personalID}', '{personalType}', '{name}', '{lname}', '{AccountNumber_non_bank}', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '{AccountNumber_non_bank}','{non_bank_2}', '{non_bank_0}',
    '{name}', '{lname}', '{AccountNumber_non_bank}', '{non_bank_2}', '{non_bank_0}', '', '', '',
    '', 'อาซิ่ง', 'ยอดเซียน', 'ไม่มี', '', '', '', '', '2568-06-11', '10:00:00', 'hhh', '10.00',
    '', '', '', '', '', '', '', '', '', '', '',
    '1433693090', 'บริษัท ช้อปปี้เพย์ (ประเทศไทย) จำกัด', '303', '', '010556416158091', 'owwpSGI2312', '', '','',''
    ]
  },
  TC003_018: {
    cell: [
    'A3', 
    'A7','B7', 'C7', 'D7', 'E7', 'F7', 'G7', 'H7', 'I7', 'J7', 'K7', 'L7', 'M7','N7','O7','P7','Q7', 'R7', 'S7', 'T7', 'U7','V7',
    'W7','X7','Y7',
    'B12', 'C12', 'D12', 'E12', 'F12', 'G12', 'H12', 'I12', 'J12', 'K12', 'L12', 'M12','N12','O12','P12','Q12', 'R12', 'S12', 'T12', 'U12',
    'V12', 'W12', 'X12', 'Y12', 'Z12', 'AA12', 'AB12', 'AC12', 'AD12', 'AE12', 'AF12',
    'AJ12', 'AK12', 'AL12', 'AM12', 'AN12', 'AO12', 'AP12', 'AQ12', 'AR12','AS12'
    ],
    valueTemplate: [
    '{bankcaseID}',
    '{personalID}', '{personalType}', '{name}', '{lname}', '{AccountNumber_non_bank}', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '{AccountNumber_non_bank}','{non_bank_2}', '{non_bank_0}',
    '{name}', '{lname}', '{AccountNumber_non_bank}', '{non_bank_2}', '{non_bank_0}', '', '', '',
    '', 'อาซิ่ง', 'ยอดเซียน', 'ไม่มี', '', '', '', '', '2568-06-11', '10:00:00', 'hhh', '10.00',
    '', '', '', '', '', '', '', '', '', '', '',
    '1433693090', 'บริษัท ช้อปปี้เพย์ (ประเทศไทย) จำกัด', '303', '', '010556416158091', '922BIS029183', '922BIS025513', 'owwpSGI2312','',`ทดสอบTest!@$%<=#"`
    ]
  },
  TC003_019: {
    cell: [
    'A3', 
    'A7','B7', 'C7', 'D7', 'E7', 'F7', 'G7', 'H7', 'I7', 'J7', 'K7', 'L7', 'M7','N7','O7','P7','Q7', 'R7', 'S7', 'T7', 'U7','V7',
    'W7','X7','Y7',
    'B12', 'C12', 'D12', 'E12', 'F12', 'G12', 'H12', 'I12', 'J12', 'K12', 'L12', 'M12','N12','O12','P12','Q12', 'R12', 'S12', 'T12', 'U12',
    'V12', 'W12', 'X12', 'Y12', 'Z12', 'AA12', 'AB12', 'AC12', 'AD12', 'AE12', 'AF12',
    'AJ12', 'AK12', 'AL12', 'AM12', 'AN12', 'AO12', 'AP12', 'AQ12', 'AR12','AS12'
    ],
    valueTemplate: [
    '{bankcaseID}',
    '{personalID}', '{personalType}', '{name}', '{lname}', '{AccountNumber_non_bank}', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '{AccountNumber_non_bank}','{non_bank_2}', '{non_bank_0}',
    '{name}', '{lname}', '{AccountNumber_non_bank}', '{non_bank_2}', '{non_bank_0}', '', '', '',
    '', 'อาซิ่ง', 'ยอดเซียน', 'ไม่มี', '', '', '', '', '2568-06-11', '10:00:00', 'hhh', '10.00',
    '', '', '', '', '', '', '', '', '', '', '',
    '1433693090', 'บริษัท ช้อปปี้เพย์ (ประเทศไทย) จำกัด', '303', '', '010556416158091', '922BIS029183', '922BIS025513', 'owwpSGI2312','ยอดเงินต่ำกว่าตามเกณฑ์ < 3,000 บาท [เส้นเงิน]',''
    ]
  },
  TC003_026: {
    cell: [
    'A3', 
    'A7','B7', 'C7', 'D7', 'E7', 'F7', 'G7', 'H7', 'I7', 'J7', 'K7', 'L7', 'M7','N7','O7','P7','Q7', 'R7', 'S7', 'T7', 'U7','V7',
    'W7','X7','Y7',
    'B12', 'C12', 'D12', 'E12', 'F12', 'G12', 'H12', 'I12', 'J12', 'K12', 'L12', 'M12','N12','O12','P12','Q12', 'R12', 'S12', 'T12', 'U12',
    'V12', 'W12', 'X12', 'Y12', 'Z12', 'AA12', 'AB12', 'AC12', 'AD12', 'AE12', 'AF12',
    'AJ12', 'AK12', 'AL12', 'AM12', 'AN12', 'AO12', 'AP12', 'AQ12', 'AR12','AS12'
    ],
    valueTemplate: [
    '{bankcaseID}',
    '{personalID}', '{personalType}', '{name}', '{lname}', '{AccountNumber_non_bank}', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '{AccountNumber_non_bank}','{non_bank_2}', '{non_bank_0}',
    '{name}', '{lname}', '{AccountNumber_non_bank}', '{non_bank_2}', '{non_bank_0}', '', '', '',
    '', 'อาซิ่ง', 'ยอดเซียน', 'ไม่มี', '', '', '', '', '2568-06-11', '10:00:00', 'hhh', '10.00',
    '', '', '', '', '', '', '', '', '', '', '',
    '1433693090', 'บริษัท ช้อปปี้เพย์ (ประเทศไทย) จำกัด', '303', '', '010556416158091', '922BIS029183', '', '','',''
    ]
  },
  TC003_044: {
    cell: [
    'A3', 
    'A7','B7', 'C7', 'D7', 'E7', 'F7', 'G7', 'H7', 'I7', 'J7', 'K7', 'L7', 'M7','N7','O7','P7','Q7', 'R7', 'S7', 'T7', 'U7','V7',
    'W7','X7','Y7',
    'B12', 'C12', 'D12', 'E12', 'F12', 'G12', 'H12', 'I12', 'J12', 'K12', 'L12', 'M12','N12','O12','P12','Q12', 'R12', 'S12', 'T12', 'U12',
    'V12', 'W12', 'X12', 'Y12', 'Z12', 'AA12', 'AB12', 'AC12', 'AD12', 'AE12', 'AF12',
    'AJ12', 'AK12', 'AL12', 'AM12', 'AN12', 'AO12', 'AP12', 'AQ12', 'AR12','AS12'
    ],
    valueTemplate: [
    '{bankcaseID}',
    '{personalID}', '{personalType}', '{name}', '{lname}', '{AccountNumber_non_bank}', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '{AccountNumber_non_bank}','{non_bank_2}', '',
    '{name}', '{lname}', '{AccountNumber_non_bank}', '{non_bank_2}', '{non_bank_0}', '', '', '',
    '', 'อาซิ่ง', 'ยอดเซียน', 'ไม่มี', '', '', '', '', '2568-06-11', '10:00:00', 'hhh', '10.00',
    '', '', '', '', '', '', '', '', '', '', '',
    '1433693090', 'บริษัท ช้อปปี้เพย์ (ประเทศไทย) จำกัด', '303', '', '010556416158091', '922BIS029183', '', '','',''
    ]
  },
  TC003_045: {
    cell: [
    'A3', 
    'A7','B7', 'C7', 'D7', 'E7', 'F7', 'G7', 'H7', 'I7', 'J7', 'K7', 'L7', 'M7','N7','O7','P7','Q7', 'R7', 'S7', 'T7', 'U7','V7',
    'W7','X7','Y7',
    'B12', 'C12', 'D12', 'E12', 'F12', 'G12', 'H12', 'I12', 'J12', 'K12', 'L12', 'M12','N12','O12','P12','Q12', 'R12', 'S12', 'T12', 'U12',
    'V12', 'W12', 'X12', 'Y12', 'Z12', 'AA12', 'AB12', 'AC12', 'AD12', 'AE12', 'AF12',
    'AJ12', 'AK12', 'AL12', 'AM12', 'AN12', 'AO12', 'AP12', 'AQ12', 'AR12','AS12'
    ],
    valueTemplate: [
    '{bankcaseID}',
    '{personalID}', '{personalType}', '{name}', '{lname}', '{AccountNumber_non_bank}', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '{AccountNumber_non_bank}','', '{non_bank_0}',
    '{name}', '{lname}', '{AccountNumber_non_bank}', '{non_bank_2}', '{non_bank_0}', '', '', '',
    '', 'อาซิ่ง', 'ยอดเซียน', 'ไม่มี', '', '', '', '', '2568-06-11', '10:00:00', 'hhh', '10.00',
    '', '', '', '', '', '', '', '', '', '', '',
    '1433693090', 'บริษัท ช้อปปี้เพย์ (ประเทศไทย) จำกัด', '303', '', '010556416158091', '922BIS029183', '', '','',''
    ]
  },
  TC003_046: {
    cell: [
    'A3', 
    'A7','B7', 'C7', 'D7', 'E7', 'F7', 'G7', 'H7', 'I7', 'J7', 'K7', 'L7', 'M7','N7','O7','P7','Q7', 'R7', 'S7', 'T7', 'U7','V7',
    'W7','X7','Y7',
    'B12', 'C12', 'D12', 'E12', 'F12', 'G12', 'H12', 'I12', 'J12', 'K12', 'L12', 'M12','N12','O12','P12','Q12', 'R12', 'S12', 'T12', 'U12',
    'V12', 'W12', 'X12', 'Y12', 'Z12', 'AA12', 'AB12', 'AC12', 'AD12', 'AE12', 'AF12',
    'AJ12', 'AK12', 'AL12', 'AM12', 'AN12', 'AO12', 'AP12', 'AQ12', 'AR12','AS12'
    ],
    valueTemplate: [
    '{bankcaseID}',
    '{personalID}', '{personalType}', '{name}', '{lname}', '{AccountNumber_non_bank}', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '{AccountNumber_non_bank}','{non_bank_2}', '888',
    '{name}', '{lname}', '{AccountNumber_non_bank}', '{non_bank_2}', '{non_bank_0}', '', '', '',
    '', 'อาซิ่ง', 'ยอดเซียน', 'ไม่มี', '', '', '', '', '2568-06-11', '10:00:00', 'hhh', '10.00',
    '', '', '', '', '', '', '', '', '', '', '',
    '1433693090', 'บริษัท ช้อปปี้เพย์ (ประเทศไทย) จำกัด', '303', '', '010556416158091', '922BIS029183', '', '','',''
    ]
  },
  TC003_049: {
    cell: [
    'A3', 
    'A7','B7', 'C7', 'D7', 'E7', 'F7', 'G7', 'H7', 'I7', 'J7', 'K7', 'L7', 'M7','N7','O7','P7','Q7', 'R7', 'S7', 'T7', 'U7','V7',
    'W7','X7','Y7',
    'B12', 'C12', 'D12', 'E12', 'F12', 'G12', 'H12', 'I12', 'J12', 'K12', 'L12', 'M12','N12','O12','P12','Q12', 'R12', 'S12', 'T12', 'U12',
    'V12', 'W12', 'X12', 'Y12', 'Z12', 'AA12', 'AB12', 'AC12', 'AD12', 'AE12', 'AF12',
    'AJ12', 'AK12', 'AL12', 'AM12', 'AN12', 'AO12', 'AP12', 'AQ12', 'AR12','AS12'
    ],
    valueTemplate: [
    '{bankcaseID}',
    '{personalID}', '{personalType}', '{name}', '{lname}', '{AccountNumber_non_bank}', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '{AccountNumber_non_bank}','{non_bank_2}', '{non_bank_0}',
    '{name}', '{lname}', '{AccountNumber_non_bank}', '{non_bank_2}', '', '', '', '',
    '', 'อาซิ่ง', 'ยอดเซียน', 'ไม่มี', '', '', '', '', '2568-06-11', '10:00:00', 'hhh', '10.00',
    '', '', '', '', '', '', '', '', '', '', '',
    '1433693090', 'บริษัท ช้อปปี้เพย์ (ประเทศไทย) จำกัด', '303', '', '010556416158091', '922BIS029183', '', '','',''
    ]
  },
  TC003_050: {
    cell: [
    'A3', 
    'A7','B7', 'C7', 'D7', 'E7', 'F7', 'G7', 'H7', 'I7', 'J7', 'K7', 'L7', 'M7','N7','O7','P7','Q7', 'R7', 'S7', 'T7', 'U7','V7',
    'W7','X7','Y7',
    'B12', 'C12', 'D12', 'E12', 'F12', 'G12', 'H12', 'I12', 'J12', 'K12', 'L12', 'M12','N12','O12','P12','Q12', 'R12', 'S12', 'T12', 'U12',
    'V12', 'W12', 'X12', 'Y12', 'Z12', 'AA12', 'AB12', 'AC12', 'AD12', 'AE12', 'AF12',
    'AJ12', 'AK12', 'AL12', 'AM12', 'AN12', 'AO12', 'AP12', 'AQ12', 'AR12','AS12'
    ],
    valueTemplate: [
    '{bankcaseID}',
    '{personalID}', '{personalType}', '{name}', '{lname}', '{AccountNumber_non_bank}', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '{AccountNumber_non_bank}','{non_bank_2}', '{non_bank_0}',
    '{name}', '{lname}', '{AccountNumber_non_bank}', '', '{non_bank_0}', '', '', '',
    '', 'อาซิ่ง', 'ยอดเซียน', 'ไม่มี', '', '', '', '', '2568-06-11', '10:00:00', 'hhh', '10.00',
    '', '', '', '', '', '', '', '', '', '', '',
    '1433693090', 'บริษัท ช้อปปี้เพย์ (ประเทศไทย) จำกัด', '303', '', '010556416158091', '922BIS029183', '', '','',''
    ]
  },
  TC003_051: {
    cell: [
    'A3', 
    'A7','B7', 'C7', 'D7', 'E7', 'F7', 'G7', 'H7', 'I7', 'J7', 'K7', 'L7', 'M7','N7','O7','P7','Q7', 'R7', 'S7', 'T7', 'U7','V7',
    'W7','X7','Y7',
    'B12', 'C12', 'D12', 'E12', 'F12', 'G12', 'H12', 'I12', 'J12', 'K12', 'L12', 'M12','N12','O12','P12','Q12', 'R12', 'S12', 'T12', 'U12',
    'V12', 'W12', 'X12', 'Y12', 'Z12', 'AA12', 'AB12', 'AC12', 'AD12', 'AE12', 'AF12',
    'AJ12', 'AK12', 'AL12', 'AM12', 'AN12', 'AO12', 'AP12', 'AQ12', 'AR12','AS12'
    ],
    valueTemplate: [
    '{bankcaseID}',
    '{personalID}', '{personalType}', '{name}', '{lname}', '{AccountNumber_non_bank}', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '{AccountNumber_non_bank}','{non_bank_2}', '{non_bank_0}',
    '{name}', '{lname}', '{AccountNumber_non_bank}', '{non_bank_2}', '888', '', '', '',
    '', 'อาซิ่ง', 'ยอดเซียน', 'ไม่มี', '', '', '', '', '2568-06-11', '10:00:00', 'hhh', '10.00',
    '', '', '', '', '', '', '', '', '', '', '',
    '1433693090', 'บริษัท ช้อปปี้เพย์ (ประเทศไทย) จำกัด', '303', '', '010556416158091', '922BIS029183', '', '','',''
    ]
  },
  TC003_054: {
    cell: [
    'A3', 
    'A7','B7', 'C7', 'D7', 'E7', 'F7', 'G7', 'H7', 'I7', 'J7', 'K7', 'L7', 'M7','N7','O7','P7','Q7', 'R7', 'S7', 'T7', 'U7','V7',
    'W7','X7','Y7',
    'B12', 'C12', 'D12', 'E12', 'F12', 'G12', 'H12', 'I12', 'J12', 'K12', 'L12', 'M12','N12','O12','P12','Q12', 'R12', 'S12', 'T12', 'U12',
    'V12', 'W12', 'X12', 'Y12', 'Z12', 'AA12', 'AB12', 'AC12', 'AD12', 'AE12', 'AF12',
    'AJ12', 'AK12', 'AL12', 'AM12', 'AN12', 'AO12', 'AP12', 'AQ12', 'AR12','AS12'
    ],
    valueTemplate: [
    '{bankcaseID}',
    '{personalID}', '{personalType}', '{name}', '{lname}', '{AccountNumber_non_bank}', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '{AccountNumber_non_bank}','{non_bank_2}', '{non_bank_0}',
    '{name}', '{lname}', '{AccountNumber_non_bank}', '{non_bank_2}', '{non_bank_0}', '', '', '',
    '', 'อาซิ่ง', 'ยอดเซียน', 'ไม่มี', '', '', '', '', '2568-06-11', '10:00:00', 'hhh', '10.00',
    '', '', '', '', '', '', '', '', '', '', '',
    '1433693090', 'บริษัท ช้อปปี้เพย์ (ประเทศไทย) จำกัด', '', '', '010556416158091', '922BIS029183', '', '','',''
    ]
  },
  TC003_055: {
    cell: [
    'A3', 
    'A7','B7', 'C7', 'D7', 'E7', 'F7', 'G7', 'H7', 'I7', 'J7', 'K7', 'L7', 'M7','N7','O7','P7','Q7', 'R7', 'S7', 'T7', 'U7','V7',
    'W7','X7','Y7',
    'B12', 'C12', 'D12', 'E12', 'F12', 'G12', 'H12', 'I12', 'J12', 'K12', 'L12', 'M12','N12','O12','P12','Q12', 'R12', 'S12', 'T12', 'U12',
    'V12', 'W12', 'X12', 'Y12', 'Z12', 'AA12', 'AB12', 'AC12', 'AD12', 'AE12', 'AF12',
    'AJ12', 'AK12', 'AL12', 'AM12', 'AN12', 'AO12', 'AP12', 'AQ12', 'AR12','AS12'
    ],
    valueTemplate: [
    '{bankcaseID}',
    '{personalID}', '{personalType}', '{name}', '{lname}', '{AccountNumber_non_bank}', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '{AccountNumber_non_bank}','{non_bank_2}', '{non_bank_0}',
    '{name}', '{lname}', '{AccountNumber_non_bank}', '{non_bank_2}', '{non_bank_0}', '', '', '',
    '', 'อาซิ่ง', 'ยอดเซียน', 'ไม่มี', '', '1433693090', '', '002', '2568-06-11', '10:00:00', 'hhh', '10.00',
    '', '', '', '', '', '', '', '', '', '', '',
    '', '', '', '', '', '', '', '','',''
    ]
  },
  TC003_056: {
    cell: [
    'A3', 
    'A7','B7', 'C7', 'D7', 'E7', 'F7', 'G7', 'H7', 'I7', 'J7', 'K7', 'L7', 'M7','N7','O7','P7','Q7', 'R7', 'S7', 'T7', 'U7','V7',
    'W7','X7','Y7',
    'B12', 'C12', 'D12', 'E12', 'F12', 'G12', 'H12', 'I12', 'J12', 'K12', 'L12', 'M12','N12','O12','P12','Q12', 'R12', 'S12', 'T12', 'U12',
    'V12', 'W12', 'X12', 'Y12', 'Z12', 'AA12', 'AB12', 'AC12', 'AD12', 'AE12', 'AF12',
    'AJ12', 'AK12', 'AL12', 'AM12', 'AN12', 'AO12', 'AP12', 'AQ12', 'AR12','AS12'
    ],
    valueTemplate: [
    '{bankcaseID}',
    '{personalID}', '{personalType}', '{name}', '{lname}', '{AccountNumber_non_bank}', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '{AccountNumber_non_bank}','{non_bank_2}', '{non_bank_0}',
    '{name}', '{lname}', '{AccountNumber_non_bank}', '{non_bank_2}', '{non_bank_0}', '', '', '',
    '', 'อาซิ่ง', 'ยอดเซียน', 'ไม่มี', '', '1433693090', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '888', '2568-06-11', '10:00:00', 'hhh', '10.00',
    '', '', '', '', '', '', '', '', '', '', '',
    '', '', '', '', '', '', '', '','',''
    ]
  },
  TC003_059: {
    cell: [
    'A3', 
    'A7','B7', 'C7', 'D7', 'E7', 'F7', 'G7', 'H7', 'I7', 'J7', 'K7', 'L7', 'M7','N7','O7','P7','Q7', 'R7', 'S7', 'T7', 'U7','V7',
    'W7','X7','Y7',
    'B12', 'C12', 'D12', 'E12', 'F12', 'G12', 'H12', 'I12', 'J12', 'K12', 'L12', 'M12','N12','O12','P12','Q12', 'R12', 'S12', 'T12', 'U12',
    'V12', 'W12', 'X12', 'Y12', 'Z12', 'AA12', 'AB12', 'AC12', 'AD12', 'AE12', 'AF12',
    'AJ12', 'AK12', 'AL12', 'AM12', 'AN12', 'AO12', 'AP12', 'AQ12', 'AR12','AS12'
    ],
    valueTemplate: [
    '{bankcaseID}',
    '{personalID}', '{personalType}', '{name}', '{lname}', '{AccountNumber_non_bank}', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '{AccountNumber_non_bank}','{non_bank_2}', '{non_bank_0}',
    '{name}', '{lname}', '{AccountNumber_non_bank}', '{non_bank_2}', '{non_bank_0}', '', '', '',
    '', 'อาซิ่ง', 'ยอดเซียน', 'ไม่มี', '', '', '', '', '2568-06-11', '10:00:00', 'hhh', '10.00',
    '', '', '', '', '', '', '', '', '', '', '',
    '1433693090', 'บริษัท ช้อปปี้เพย์ (ประเทศไทย) จำกัด', '', '', '010556416158090', '0129382749182', '', '','',''
    ]
  },
  TC003_060: {
    cell: [
    'A3', 
    'A7','B7', 'C7', 'D7', 'E7', 'F7', 'G7', 'H7', 'I7', 'J7', 'K7', 'L7', 'M7','N7','O7','P7','Q7', 'R7', 'S7', 'T7', 'U7','V7',
    'W7','X7','Y7',
    'B12', 'C12', 'D12', 'E12', 'F12', 'G12', 'H12', 'I12', 'J12', 'K12', 'L12', 'M12','N12','O12','P12','Q12', 'R12', 'S12', 'T12', 'U12',
    'V12', 'W12', 'X12', 'Y12', 'Z12', 'AA12', 'AB12', 'AC12', 'AD12', 'AE12', 'AF12',
    'AJ12', 'AK12', 'AL12', 'AM12', 'AN12', 'AO12', 'AP12', 'AQ12', 'AR12','AS12'
    ],
    valueTemplate: [
    '{bankcaseID}',
    '{personalID}', '{personalType}', '{name}', '{lname}', '{AccountNumber_non_bank}', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '{AccountNumber_non_bank}','{non_bank_2}', '{non_bank_0}',
    '{name}', '{lname}', '{AccountNumber_non_bank}', '{non_bank_2}', '{non_bank_0}', '', '', '',
    '', 'อาซิ่ง', 'ยอดเซียน', 'ไม่มี', '', '', '', '', '2568-06-11', '10:00:00', 'hhh', '10.00',
    '', '', '', '', '', '', '', '', '', '', '',
    '', '', '0105564161580', '', '010556416158019', '0129382749182', '', '','',''
    ]
  },
  TC003_061: {
    cell: [
    'A3', 
    'A7','B7', 'C7', 'D7', 'E7', 'F7', 'G7', 'H7', 'I7', 'J7', 'K7', 'L7', 'M7','N7','O7','P7','Q7', 'R7', 'S7', 'T7', 'U7','V7',
    'W7','X7','Y7',
    'B12', 'C12', 'D12', 'E12', 'F12', 'G12', 'H12', 'I12', 'J12', 'K12', 'L12', 'M12','N12','O12','P12','Q12', 'R12', 'S12', 'T12', 'U12',
    'V12', 'W12', 'X12', 'Y12', 'Z12', 'AA12', 'AB12', 'AC12', 'AD12', 'AE12', 'AF12',
    'AJ12', 'AK12', 'AL12', 'AM12', 'AN12', 'AO12', 'AP12', 'AQ12', 'AR12','AS12'
    ],
    valueTemplate: [
    '{bankcaseID}',
    '{personalID}', '{personalType}', '{name}', '{lname}', '{AccountNumber_non_bank}', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '{AccountNumber_non_bank}','{non_bank_2}', '{non_bank_0}',
    '{name}', '{lname}', '{AccountNumber_non_bank}', '{non_bank_2}', '{non_bank_0}', '', '', '',
    '', 'อาซิ่ง', 'ยอดเซียน', 'ไม่มี', '', '', '', '', '2568-06-11', '10:00:00', 'hhh', '10.00',
    '', '', '', '', '', '', '', '', '', '', '',
    '', 'บริษัท คาร์ด เอกซ์ จำกัด', '888', '', '010556416158019', '0129382749182', '', '','',''
    ]
  },
  TC003_065: {
    cell: [
    'A3', 
    'A7','B7', 'C7', 'D7', 'E7', 'F7', 'G7', 'H7', 'I7', 'J7', 'K7', 'L7', 'M7','N7','O7','P7','Q7', 'R7', 'S7', 'T7', 'U7','V7',
    'W7','X7','Y7',
    'B12', 'C12', 'D12', 'E12', 'F12', 'G12', 'H12', 'I12', 'J12', 'K12', 'L12', 'M12','N12','O12','P12','Q12', 'R12', 'S12', 'T12', 'U12',
    'V12', 'W12', 'X12', 'Y12', 'Z12', 'AA12', 'AB12', 'AC12', 'AD12', 'AE12', 'AF12',
    'AJ12', 'AK12', 'AL12', 'AM12', 'AN12', 'AO12', 'AP12', 'AQ12', 'AR12','AS12'
    ],
    valueTemplate: [
    '{bankcaseID}',
    '{personalID}', '{personalType}', '{name}', '{lname}', '{AccountNumber_non_bank}', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '{AccountNumber_non_bank}','{non_bank_2}', '{non_bank_0}',
    '{name}', '{lname}', '{AccountNumber_non_bank}', '{non_bank_2}', '{non_bank_0}', '', '', '',
    '', 'อาซิ่ง', 'ยอดเซียน', 'ไม่มี', '', '', '', '', '2568-06-11', '10:00:00', 'hhh', '10.00',
    '', '', '', '', '', '', '', '', '', '', '',
    '', 'บริษัท คาร์ด เอกซ์ จำกัด', '0105564161580', '', '010556416158061', '2938210293281', '', '','',''
    ]
  },
  TC003_066: {
    cell: [
    'A3', 
    'A7','B7', 'C7', 'D7', 'E7', 'F7', 'G7', 'H7', 'I7', 'J7', 'K7', 'L7', 'M7','N7','O7','P7','Q7', 'R7', 'S7', 'T7', 'U7','V7',
    'W7','X7','Y7',
    'B12', 'C12', 'D12', 'E12', 'F12', 'G12', 'H12', 'I12', 'J12', 'K12', 'L12', 'M12','N12','O12','P12','Q12', 'R12', 'S12', 'T12', 'U12',
    'V12', 'W12', 'X12', 'Y12', 'Z12', 'AA12', 'AB12', 'AC12', 'AD12', 'AE12', 'AF12',
    'AJ12', 'AK12', 'AL12', 'AM12', 'AN12', 'AO12', 'AP12', 'AQ12', 'AR12','AS12'
    ],
    valueTemplate: [
    '{bankcaseID}',
    '{personalID}', '{personalType}', '{name}', '{lname}', '{AccountNumber_non_bank}', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '{AccountNumber_non_bank}','{non_bank_2}', '{non_bank_0}',
    '{name}', '{lname}', '{AccountNumber_non_bank}', '{non_bank_2}', '{non_bank_0}', '', '', '',
    '', 'อาซิ่ง', 'ยอดเซียน', 'ไม่มี', '', '', '', '', '2568-06-11', '10:00:00', 'hhh', '10.00',
    '', '', '', '', '', '', '', '', '', '', '',
    '9877898765', 'บริษัท ทูซีทูพี พลัส (ประเทศไทย) จำกัด', '344', '', '010555814254433', '2938210293281', '', '','',''
    ]
  },
  TC003_067: {
    cell: [
    'A3', 
    'A7','B7', 'C7', 'D7', 'E7', 'F7', 'G7', 'H7', 'I7', 'J7', 'K7', 'L7', 'M7','N7','O7','P7','Q7', 'R7', 'S7', 'T7', 'U7','V7',
    'W7','X7','Y7',
    'B12', 'C12', 'D12', 'E12', 'F12', 'G12', 'H12', 'I12', 'J12', 'K12', 'L12', 'M12','N12','O12','P12','Q12', 'R12', 'S12', 'T12', 'U12',
    'V12', 'W12', 'X12', 'Y12', 'Z12', 'AA12', 'AB12', 'AC12', 'AD12', 'AE12', 'AF12',
    'AJ12', 'AK12', 'AL12', 'AM12', 'AN12', 'AO12', 'AP12', 'AQ12', 'AR12','AS12'
    ],
    valueTemplate: [
    '{bankcaseID}',
    '{personalID}', '{personalType}', '{name}', '{lname}', '{AccountNumber_non_bank}', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '{AccountNumber_non_bank}','{non_bank_2}', '{non_bank_0}',
    '{name}', '{lname}', '{AccountNumber_non_bank}', '{non_bank_2}', '{non_bank_0}', '', '', '',
    '', 'อาซิ่ง', 'ยอดเซียน', 'ไม่มี', '', '', '', '', '2568-06-11', '10:00:00', 'hhh', '10.00',
    '', '', '', '', '', '', '', '', '', '', '',
    '7585960987', 'บริษัท ทูซีทูพี พลัส (ประเทศไทย) จำกัด', '344', '', '010555814254433', '2938210293281', '', '','ยอดการระงับได้มากกว่าหรือเท่ากับยอดที่โอนมา',''
    ]
  },
  TC003_068: {
    cell: [
    'A3', 
    'A7','B7', 'C7', 'D7', 'E7', 'F7', 'G7', 'H7', 'I7', 'J7', 'K7', 'L7', 'M7','N7','O7','P7','Q7', 'R7', 'S7', 'T7', 'U7','V7',
    'W7','X7','Y7',
    'B12', 'C12', 'D12', 'E12', 'F12', 'G12', 'H12', 'I12', 'J12', 'K12', 'L12', 'M12','N12','O12','P12','Q12', 'R12', 'S12', 'T12', 'U12',
    'V12', 'W12', 'X12', 'Y12', 'Z12', 'AA12', 'AB12', 'AC12', 'AD12', 'AE12', 'AF12',
    'AJ12', 'AK12', 'AL12', 'AM12', 'AN12', 'AO12', 'AP12', 'AQ12', 'AR12','AS12'
    ],
    valueTemplate: [
    '{bankcaseID}',
    '{personalID}', '{personalType}', '{name}', '{lname}', '{AccountNumber_non_bank}', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '{AccountNumber_non_bank}','{non_bank_2}', '{non_bank_0}',
    '{name}', '{lname}', '{AccountNumber_non_bank}', '{non_bank_2}', '{non_bank_0}', '', '', '',
    '', 'อาซิ่ง', 'ยอดเซียน', 'ไม่มี', '', '', '', '', '2568-06-11', '10:00:00', 'hhh', '10.00',
    '', '', '', '', '', '', '', '', '', '', '',
    '7585960987', 'บริษัท ทูซีทูพี พลัส (ประเทศไทย) จำกัด', '344', '', '010555814254433', '2938210293281', '', '','ชำระด้วยบัตรผ่าน Card Scheme',''
    ]
  },
  TC003_070: {
    cell: [
    'A3', 
    'A7','B7', 'C7', 'D7', 'E7', 'F7', 'G7', 'H7', 'I7', 'J7', 'K7', 'L7', 'M7','N7','O7','P7','Q7', 'R7', 'S7', 'T7', 'U7','V7',
    'W7','X7','Y7',
    'B12', 'C12', 'D12', 'E12', 'F12', 'G12', 'H12', 'I12', 'J12', 'K12', 'L12', 'M12','N12','O12','P12','Q12', 'R12', 'S12', 'T12', 'U12',
    'V12', 'W12', 'X12', 'Y12', 'Z12', 'AA12', 'AB12', 'AC12', 'AD12', 'AE12', 'AF12',
    'AJ12', 'AK12', 'AL12', 'AM12', 'AN12', 'AO12', 'AP12', 'AQ12', 'AR12','AS12'
    ],
    valueTemplate: [
    '{bankcaseID}',
    '{personalID}', '{personalType}', '{name}', '{lname}', '{AccountNumber_non_bank}', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '{AccountNumber_non_bank}','{non_bank_2}', '{non_bank_0}',
    '{name}', '{lname}', '{AccountNumber_non_bank}', '{non_bank_2}', '{non_bank_0}', '', '', '',
    '', 'อาซิ่ง', 'ยอดเซียน', 'ไม่มี', '', '7585960987', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '2568-06-11', '10:00:00', 'hhh', '10.00',
    '', '', '', '', '', '', '', '', '', '', '',
    '', '', '', '', '', '', '', '','ชำระด้วยบัตรผ่าน Card Scheme',''
    ]
  },
  TC003_071: {
    cell: [
    'A3', 
    'A7','B7', 'C7', 'D7', 'E7', 'F7', 'G7', 'H7', 'I7', 'J7', 'K7', 'L7', 'M7','N7','O7','P7','Q7', 'R7', 'S7', 'T7', 'U7','V7',
    'W7','X7','Y7',
    'B12', 'C12', 'D12', 'E12', 'F12', 'G12', 'H12', 'I12', 'J12', 'K12', 'L12', 'M12','N12','O12','P12','Q12', 'R12', 'S12', 'T12', 'U12',
    'V12', 'W12', 'X12', 'Y12', 'Z12', 'AA12', 'AB12', 'AC12', 'AD12', 'AE12', 'AF12',
    'AJ12', 'AK12', 'AL12', 'AM12', 'AN12', 'AO12', 'AP12', 'AQ12', 'AR12','AS12'
    ],
    valueTemplate: [
    '{bankcaseID}',
    '{personalID}', '{personalType}', '{name}', '{lname}', '{AccountNumber_non_bank}', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '{AccountNumber_non_bank}','{non_bank_2}', '{non_bank_0}',
    '{name}', '{lname}', '{AccountNumber_non_bank}', '{non_bank_2}', '{non_bank_0}', '', '', '',
    '', 'อาซิ่ง', 'ยอดเซียน', 'ไม่มี', '', '7585960987', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '2568-06-11', '10:00:00', 'hhh', '10.00',
    '', '', '', '', '', '', '', '', '', '', '',
    '', '', '', '', '', '', '', '','',''
    ]
  },
  TC003_073: {
    cell: [
    'A3', 
    'A7','B7', 'C7', 'D7', 'E7', 'F7', 'G7', 'H7', 'I7', 'J7', 'K7', 'L7', 'M7','N7','O7','P7','Q7', 'R7', 'S7', 'T7', 'U7','V7',
    'W7','X7','Y7',
    'B12', 'C12', 'D12', 'E12', 'F12', 'G12', 'H12', 'I12', 'J12', 'K12', 'L12', 'M12','N12','O12','P12','Q12', 'R12', 'S12', 'T12', 'U12',
    'V12', 'W12', 'X12', 'Y12', 'Z12', 'AA12', 'AB12', 'AC12', 'AD12', 'AE12', 'AF12',
    'AJ12', 'AK12', 'AL12', 'AM12', 'AN12', 'AO12', 'AP12', 'AQ12', 'AR12','AS12'
    ],
    valueTemplate: [
    '{bankcaseID}',
    '{personalID}', '{personalType}', '{name}', '{lname}', '{AccountNumber_non_bank}', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '{AccountNumber_non_bank}','{non_bank_2}', '{non_bank_0}',
    '{name}', '{lname}', '{AccountNumber_non_bank}', '{non_bank_2}', '{non_bank_0}', '', '', '',
    '', 'อาซิ่ง', 'ยอดเซียน', 'ไม่มี', '', '', '', '', '2568-06-11', '10:00:00', 'hhh', '10.00',
    '', '', '', '', '', '', '', '', '', '', '',
    '7585960987', 'บริษัท ทูซีทูพี พลัส (ประเทศไทย) จำกัด', '344', '', '010556117767145', '2938210293281', '', '','ชำระด้วยบัตรผ่าน Card Scheme',''
    ]
  },
  TC003_077: {
    cell: [
    'A3', 
    'A7','B7', 'C7', 'D7', 'E7', 'F7', 'G7', 'H7', 'I7', 'J7', 'K7', 'L7', 'M7','N7','O7','P7','Q7', 'R7', 'S7', 'T7', 'U7','V7',
    'W7','X7','Y7',
    'B12', 'C12', 'D12', 'E12', 'F12', 'G12', 'H12', 'I12', 'J12', 'K12', 'L12', 'M12','N12','O12','P12','Q12', 'R12', 'S12', 'T12', 'U12',
    'V12', 'W12', 'X12', 'Y12', 'Z12', 'AA12', 'AB12', 'AC12', 'AD12', 'AE12', 'AF12',
    'AJ12', 'AK12', 'AL12', 'AM12', 'AN12', 'AO12', 'AP12', 'AQ12', 'AR12','AS12'
    ],
    valueTemplate: [
    '{bankcaseID}',
    '{personalID}', '{personalType}', '{name}', '{lname}', '{AccountNumber_non_bank}', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '{AccountNumber_non_bank}','{non_bank_2}', '{non_bank_0}',
    '{name}', '{lname}', '{AccountNumber_non_bank}', '{non_bank_2}', '{non_bank_0}', '', '', '',
    '', 'อาซิ่ง', 'ยอดเซียน', 'เบอร์โทร', '+66987654567', '7585960987', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '2568-06-11', '10:00:00', 'hhh', '10.00',
    '', '', '', '', '', '', '', '', '', '', '',
    '', '', '', '', '', '', '', '','',''
    ]
  },
  TC003_079: {
    cell: [
    'A3', 
    'A7','B7', 'C7', 'D7', 'E7', 'F7', 'G7', 'H7', 'I7', 'J7', 'K7', 'L7', 'M7','N7','O7','P7','Q7', 'R7', 'S7', 'T7', 'U7','V7',
    'W7','X7','Y7',
    'B12', 'C12', 'D12', 'E12', 'F12', 'G12', 'H12', 'I12', 'J12', 'K12', 'L12', 'M12','N12','O12','P12','Q12', 'R12', 'S12', 'T12', 'U12',
    'V12', 'W12', 'X12', 'Y12', 'Z12', 'AA12', 'AB12', 'AC12', 'AD12', 'AE12', 'AF12',
    'AJ12', 'AK12', 'AL12', 'AM12', 'AN12', 'AO12', 'AP12', 'AQ12', 'AR12','AS12'
    ],
    valueTemplate: [
    '{bankcaseID}',
    '{personalID}', '{personalType}', '{name}', '{lname}', '{AccountNumber_non_bank}', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '{AccountNumber_non_bank}','{non_bank_2}', '{non_bank_0}',
    '{name}', '{lname}', '{AccountNumber_non_bank}', '{non_bank_2}', '{non_bank_0}', '', '', '',
    '', 'อาซิ่ง', 'ยอดเซียน', 'หมายเลขบัตรประชาชน', '1649084168693', '7585960987', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '2568-06-11', '10:00:00', 'hhh', '10.00',
    '', '', '', '', '', '', '', '', '', '', '',
    '', '', '', '', '', '', '', '','',''
    ]
  },
  TC003_080: {
    cell: [
    'A3', 
    'A7','B7', 'C7', 'D7', 'E7', 'F7', 'G7', 'H7', 'I7', 'J7', 'K7', 'L7', 'M7','N7','O7','P7','Q7', 'R7', 'S7', 'T7', 'U7','V7',
    'W7','X7','Y7',
    'B12', 'C12', 'D12', 'E12', 'F12', 'G12', 'H12', 'I12', 'J12', 'K12', 'L12', 'M12','N12','O12','P12','Q12', 'R12', 'S12', 'T12', 'U12',
    'V12', 'W12', 'X12', 'Y12', 'Z12', 'AA12', 'AB12', 'AC12', 'AD12', 'AE12', 'AF12',
    'AJ12', 'AK12', 'AL12', 'AM12', 'AN12', 'AO12', 'AP12', 'AQ12', 'AR12','AS12'
    ],
    valueTemplate: [
    '{bankcaseID}',
    '{personalID}', '{personalType}', '{name}', '{lname}', '{AccountNumber_non_bank}', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '{AccountNumber_non_bank}','{non_bank_2}', '{non_bank_0}',
    '{name}', '{lname}', '{AccountNumber_non_bank}', '{non_bank_2}', '{non_bank_0}', '', '', '',
    '', 'อาซิ่ง', 'ยอดเซียน', 'e-wallet', '140367490195616', '', '', '', '2568-06-11', '10:00:00', 'hhh', '10.00',
    '', '', '', '', '', '', '', '', '', '', '',
    '', '', '', 'BBL:1234567890', '', '', '', '','',''
    ]
  },
  TC003_081: {
    cell: [
    'A3', 
    'A7','B7', 'C7', 'D7', 'E7', 'F7', 'G7', 'H7', 'I7', 'J7', 'K7', 'L7', 'M7','N7','O7','P7','Q7', 'R7', 'S7', 'T7', 'U7','V7',
    'W7','X7','Y7',
    'B12', 'C12', 'D12', 'E12', 'F12', 'G12', 'H12', 'I12', 'J12', 'K12', 'L12', 'M12','N12','O12','P12','Q12', 'R12', 'S12', 'T12', 'U12',
    'V12', 'W12', 'X12', 'Y12', 'Z12', 'AA12', 'AB12', 'AC12', 'AD12', 'AE12', 'AF12',
    'AJ12', 'AK12', 'AL12', 'AM12', 'AN12', 'AO12', 'AP12', 'AQ12', 'AR12','AS12'
    ],
    valueTemplate: [
    '{bankcaseID}',
    '{personalID}', '{personalType}', '{name}', '{lname}', '{AccountNumber_non_bank}', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '{AccountNumber_non_bank}','{non_bank_2}', '{non_bank_0}',
    '{name}', '{lname}', '{AccountNumber_non_bank}', '{non_bank_2}', '{non_bank_0}', '', '', '',
    '', 'อาซิ่ง', 'ยอดเซียน', 'e-wallet', '140367490195616', '', '', '', '2568-06-11', '10:00:00', 'hhh', '10.00',
    '', '', '', '', '', '', '', '', '', '', '',
    '2739918571', 'บริษัท ทรูมันนี่ จำกัด', '919', 'BBL:0059294921', '', '', '', '','',''
    ]
  },
  TC003_084: {
    cell: [
    'A3', 
    'A7','B7', 'C7', 'D7', 'E7', 'F7', 'G7', 'H7', 'I7', 'J7', 'K7', 'L7', 'M7','N7','O7','P7','Q7', 'R7', 'S7', 'T7', 'U7','V7',
    'W7','X7','Y7',
    'B12', 'C12', 'D12', 'E12', 'F12', 'G12', 'H12', 'I12', 'J12', 'K12', 'L12', 'M12','N12','O12','P12','Q12', 'R12', 'S12', 'T12', 'U12',
    'V12', 'W12', 'X12', 'Y12', 'Z12', 'AA12', 'AB12', 'AC12', 'AD12', 'AE12', 'AF12',
    'AJ12', 'AK12', 'AL12', 'AM12', 'AN12', 'AO12', 'AP12', 'AQ12', 'AR12','AS12'
    ],
    valueTemplate: [
    '{bankcaseID}',
    '{personalID}', '{personalType}', '{name}', '{lname}', '{AccountNumber_non_bank}', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '{AccountNumber_non_bank}','{non_bank_2}', '{non_bank_0}',
    '{name}', '{lname}', '{AccountNumber_non_bank}', '{non_bank_2}', '{non_bank_0}', '', '', '',
    '', 'อาซิ่ง', 'ยอดเซียน', 'ไม่มี', '', '', '', '', '2568-06-11', '10:00:00', 'hhh', '10.00',
    '', '', '', '', '', '', '', '', '', '', '',
    '', '', '', '', '', '', '', '','ถอนเงินสดผ่านเอทีเอ็ม',''
    ]
  },
  TC003_085: {
    cell: [
    'A3', 
    'A7','B7', 'C7', 'D7', 'E7', 'F7', 'G7', 'H7', 'I7', 'J7', 'K7', 'L7', 'M7','N7','O7','P7','Q7', 'R7', 'S7', 'T7', 'U7','V7',
    'W7','X7','Y7',
    'B12', 'C12', 'D12', 'E12', 'F12', 'G12', 'H12', 'I12', 'J12', 'K12', 'L12', 'M12','N12','O12','P12','Q12', 'R12', 'S12', 'T12', 'U12',
    'V12', 'W12', 'X12', 'Y12', 'Z12', 'AA12', 'AB12', 'AC12', 'AD12', 'AE12', 'AF12',
    'AJ12', 'AK12', 'AL12', 'AM12', 'AN12', 'AO12', 'AP12', 'AQ12', 'AR12','AS12'
    ],
    valueTemplate: [
    '{bankcaseID}',
    '{personalID}', '{personalType}', '{name}', '{lname}', '{AccountNumber_non_bank}', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '{AccountNumber_non_bank}','{non_bank_2}', '{non_bank_0}',
    '{name}', '{lname}', '{AccountNumber_non_bank}', '{non_bank_2}', '{non_bank_0}', '', '', '',
    '', 'อาซิ่ง', 'ยอดเซียน', 'ไม่มี', '', '', '', '', '2568-06-11', '10:00:00', 'hhh', '10.00',
    '', '', '', '', '', '', '', '', '', '', '',
    '', '', '', '', '', '', '', '','ถอนเงินสดที่สาขา',''
    ]
  },
  TC003_086: {
    cell: [
    'A3', 
    'A7','B7', 'C7', 'D7', 'E7', 'F7', 'G7', 'H7', 'I7', 'J7', 'K7', 'L7', 'M7','N7','O7','P7','Q7', 'R7', 'S7', 'T7', 'U7','V7',
    'W7','X7','Y7',
    'B12', 'C12', 'D12', 'E12', 'F12', 'G12', 'H12', 'I12', 'J12', 'K12', 'L12', 'M12','N12','O12','P12','Q12', 'R12', 'S12', 'T12', 'U12',
    'V12', 'W12', 'X12', 'Y12', 'Z12', 'AA12', 'AB12', 'AC12', 'AD12', 'AE12', 'AF12',
    'AJ12', 'AK12', 'AL12', 'AM12', 'AN12', 'AO12', 'AP12', 'AQ12', 'AR12','AS12'
    ],
    valueTemplate: [
    '{bankcaseID}',
    '{personalID}', '{personalType}', '{name}', '{lname}', '{AccountNumber_non_bank}', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '{AccountNumber_non_bank}','{non_bank_2}', '{non_bank_0}',
    '{name}', '{lname}', '{AccountNumber_non_bank}', '{non_bank_2}', '{non_bank_0}', '', '', '',
    '', 'อาซิ่ง', 'ยอดเซียน', 'ไม่มี', '', '', '', '', '2568-06-11', '10:00:00', 'hhh', '10.00',
    '', '', '', '', '', '', '', '', '', '', '',
    '', '', '', '', '', '', '', '','สินทรัพย์ดิจิตอลถูกส่งไปยังปลายทางที่ไม่ทราบผู้ให้บริการ (Private Wallet)',''
    ]
  },
  TC003_090: {
    cell: [
    'A3', 
    'A7','B7', 'C7', 'D7', 'E7', 'F7', 'G7', 'H7', 'I7', 'J7', 'K7', 'L7', 'M7','N7','O7','P7','Q7', 'R7', 'S7', 'T7', 'U7','V7',
    'W7','X7','Y7',
    'B12', 'C12', 'D12', 'E12', 'F12', 'G12', 'H12', 'I12', 'J12', 'K12', 'L12', 'M12','N12','O12','P12','Q12', 'R12', 'S12', 'T12', 'U12',
    'V12', 'W12', 'X12', 'Y12', 'Z12', 'AA12', 'AB12', 'AC12', 'AD12', 'AE12', 'AF12',
    'AJ12', 'AK12', 'AL12', 'AM12', 'AN12', 'AO12', 'AP12', 'AQ12', 'AR12','AS12'
    ],
    valueTemplate: [
    '{bankcaseID}',
    '{personalID}', '{personalType}', '{name}', '{lname}', '{AccountNumber_non_bank}', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '{AccountNumber_non_bank}','{non_bank_2}', '{non_bank_0}',
    '{name}', '{lname}', '{AccountNumber_non_bank}', '{non_bank_2}', '{non_bank_0}', '', '', '',
    '', 'อาซิ่ง', 'ยอดเซียน', 'e-wallet', '004950229103921', '', '', '', '2568-06-11', '10:00:00', 'hhh', '10.00',
    '', '', '', '', '', '', '', '', '', '', '',
    '', '', '', 'BBL:0059294921', '010556117767145', '2938210293281', '', '','',''
    ]
  },
  TC003_092: {
    cell: [
    'A3', 
    'A7','B7', 'C7', 'D7', 'E7', 'F7', 'G7', 'H7', 'I7', 'J7', 'K7', 'L7', 'M7','N7','O7','P7','Q7', 'R7', 'S7', 'T7', 'U7','V7',
    'W7','X7','Y7',
    'B12', 'C12', 'D12', 'E12', 'F12', 'G12', 'H12', 'I12', 'J12', 'K12', 'L12', 'M12','N12','O12','P12','Q12', 'R12', 'S12', 'T12', 'U12',
    'V12', 'W12', 'X12', 'Y12', 'Z12', 'AA12', 'AB12', 'AC12', 'AD12', 'AE12', 'AF12',
    'AJ12', 'AK12', 'AL12', 'AM12', 'AN12', 'AO12', 'AP12', 'AQ12', 'AR12','AS12'
    ],
    valueTemplate: [
    '{bankcaseID}',
    '{personalID}', '{personalType}', '{name}', '{lname}', '{AccountNumber_non_bank}', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '{AccountNumber_non_bank}','{non_bank_2}', '{non_bank_0}',
    '{name}', '{lname}', '{AccountNumber_non_bank}', '{non_bank_2}', '{non_bank_0}', '', '', '',
    '', 'อาซิ่ง', 'ยอดเซียน', 'ไม่มี', '', '8841299172', 'ธนาคารกรุงเทพ จำกัด (มหาชน)', '002', '2568-06-11', '10:00:00', 'hhh', '10.00',
    '', '', '', '', '', '', '', '', '', '', '',
    '', '', '', '', '010556117767145', '2938210293281', '', '','',''
    ]
  },
  TC003_096: {
    cell: [
    'A3', 
    'A7','B7', 'C7', 'D7', 'E7', 'F7', 'G7', 'H7', 'I7', 'J7', 'K7', 'L7', 'M7','N7','O7','P7','Q7', 'R7', 'S7', 'T7', 'U7','V7',
    'W7','X7','Y7',
    'B12', 'C12', 'D12', 'E12', 'F12', 'G12', 'H12', 'I12', 'J12', 'K12', 'L12', 'M12','N12','O12','P12','Q12', 'R12', 'S12', 'T12', 'U12',
    'V12', 'W12', 'X12', 'Y12', 'Z12', 'AA12', 'AB12', 'AC12', 'AD12', 'AE12', 'AF12',
    'AJ12', 'AK12', 'AL12', 'AM12', 'AN12', 'AO12', 'AP12', 'AQ12', 'AR12','AS12'
    ],
    valueTemplate: [
    '{bankcaseID}',
    '{personalID}', '{personalType}', '{name}', '{lname}', '{AccountNumber_non_bank}', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '{AccountNumber_non_bank}','{non_bank_2}', '{non_bank_0}',
    '{name}', '{lname}', '{AccountNumber_non_bank}', '{non_bank_2}', '{non_bank_0}', '', '', '',
    '', 'อาซิ่ง', 'ยอดเซียน', 'ไม่มี', '', '', '', '', '2568-06-11', '10:00:00', 'hhh', '10.00',
    '', '', '', '', '', '', '', '', '', '', '',
    '8841299172', 'บริษัท บิทคับ ออนไลน์ จำกัด', '0105559117128', '', '111222333444555', '4471RT', '', '','',''
    ]
  },
  TC003_097: {
    cell: [
    'A3', 
    'A7','B7', 'C7', 'D7', 'E7', 'F7', 'G7', 'H7', 'I7', 'J7', 'K7', 'L7', 'M7','N7','O7','P7','Q7', 'R7', 'S7', 'T7', 'U7','V7',
    'W7','X7','Y7',
    'B12', 'C12', 'D12', 'E12', 'F12', 'G12', 'H12', 'I12', 'J12', 'K12', 'L12', 'M12','N12','O12','P12','Q12', 'R12', 'S12', 'T12', 'U12',
    'V12', 'W12', 'X12', 'Y12', 'Z12', 'AA12', 'AB12', 'AC12', 'AD12', 'AE12', 'AF12',
    'AJ12', 'AK12', 'AL12', 'AM12', 'AN12', 'AO12', 'AP12', 'AQ12', 'AR12','AS12'
    ],
    valueTemplate: [
    '{bankcaseID}',
    '{personalID}', '{personalType}', '{name}', '{lname}', '{AccountNumber_non_bank}', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '{AccountNumber_non_bank}','{non_bank_2}', '{non_bank_0}',
    '{name}', '{lname}', '{AccountNumber_non_bank}', '{non_bank_2}', '{non_bank_0}', '', '', '',
    '', 'อาซิ่ง', 'ยอดเซียน', 'ไม่มี', '', '', '', '', '2568-06-11', '10:00:00', 'hhh', '10.00',
    '', '', '', '', '', '', '', '', '', '', '',
    '', '', '', '', '961822837128392', '0002229381232', '', '','',''
    ]
  },
  TC003_098: {
    cell: [
    'A3', 
    'A7','B7', 'C7', 'D7', 'E7', 'F7', 'G7', 'H7', 'I7', 'J7', 'K7', 'L7', 'M7','N7','O7','P7','Q7', 'R7', 'S7', 'T7', 'U7','V7',
    'W7','X7','Y7',
    'B12', 'C12', 'D12', 'E12', 'F12', 'G12', 'H12', 'I12', 'J12', 'K12', 'L12', 'M12','N12','O12','P12','Q12', 'R12', 'S12', 'T12', 'U12',
    'V12', 'W12', 'X12', 'Y12', 'Z12', 'AA12', 'AB12', 'AC12', 'AD12', 'AE12', 'AF12',
    'AJ12', 'AK12', 'AL12', 'AM12', 'AN12', 'AO12', 'AP12', 'AQ12', 'AR12','AS12'
    ],
    valueTemplate: [
    '{bankcaseID}',
    '{personalID}', '{personalType}', '{name}', '{lname}', '{AccountNumber_non_bank}', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '{AccountNumber_non_bank}','{non_bank_2}', '{non_bank_0}',
    '{name}', '{lname}', '{AccountNumber_non_bank}', '{non_bank_2}', '{non_bank_0}', '', '', '',
    '', 'อาซิ่ง', 'ยอดเซียน', 'ไม่มี', '', '', '', '', '2568-06-11', '10:00:00', 'hhh', '10.00',
    '', '', '', '', '', '', '', '', '', '', '',
    '', '', '', '', '762263000000000', 'BB273IO', '', '','',''
    ]
  },
  TC003_099: {
    cell: [
    'A3', 
    'A7','B7', 'C7', 'D7', 'E7', 'F7', 'G7', 'H7', 'I7', 'J7', 'K7', 'L7', 'M7','N7','O7','P7','Q7', 'R7', 'S7', 'T7', 'U7','V7',
    'W7','X7','Y7',
    'B12', 'C12', 'D12', 'E12', 'F12', 'G12', 'H12', 'I12', 'J12', 'K12', 'L12', 'M12','N12','O12','P12','Q12', 'R12', 'S12', 'T12', 'U12',
    'V12', 'W12', 'X12', 'Y12', 'Z12', 'AA12', 'AB12', 'AC12', 'AD12', 'AE12', 'AF12',
    'AJ12', 'AK12', 'AL12', 'AM12', 'AN12', 'AO12', 'AP12', 'AQ12', 'AR12','AS12'
    ],
    valueTemplate: [
    '{bankcaseID}',
    '{personalID}', '{personalType}', '{name}', '{lname}', '{AccountNumber_non_bank}', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '{AccountNumber_non_bank}','{non_bank_2}', '{non_bank_0}',
    '{name}', '{lname}', '{AccountNumber_non_bank}', '{non_bank_2}', '{non_bank_0}', '', '', '',
    '', 'อาซิ่ง', 'ยอดเซียน', 'ไม่มี', '', '', '', '', '2568-06-11', '10:00:00', 'hhh', '10.00',
    '', '', '', '', '', '', '', '', '', '', '',
    '', 'บริษัท แมกซ์ การ์ด จำกัด', '0105563162337', '', '010556505535001', 'REF7551200391', '', '','',''
    ]
  },
  TC003_100: {
    cell: [
    'A3', 
    'A7','B7', 'C7', 'D7', 'E7', 'F7', 'G7', 'H7', 'I7', 'J7', 'K7', 'L7', 'M7','N7','O7','P7','Q7', 'R7', 'S7', 'T7', 'U7','V7',
    'W7','X7','Y7',
    'B12', 'C12', 'D12', 'E12', 'F12', 'G12', 'H12', 'I12', 'J12', 'K12', 'L12', 'M12','N12','O12','P12','Q12', 'R12', 'S12', 'T12', 'U12',
    'V12', 'W12', 'X12', 'Y12', 'Z12', 'AA12', 'AB12', 'AC12', 'AD12', 'AE12', 'AF12',
    'AJ12', 'AK12', 'AL12', 'AM12', 'AN12', 'AO12', 'AP12', 'AQ12', 'AR12','AS12'
    ],
    valueTemplate: [
    '{bankcaseID}',
    '{personalID}', '{personalType}', '{name}', '{lname}', '{AccountNumber_non_bank}', '', '',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
    '{AccountNumber_non_bank}','{non_bank_2}', '{non_bank_0}',
    '{name}', '{lname}', '{AccountNumber_non_bank}', '{non_bank_2}', '{non_bank_0}', '', '', '',
    '', 'อาซิ่ง', 'ยอดเซียน', 'ไม่มี', '', '', '', '', '2568-06-11', '10:00:00', 'hhh', '10.00',
    '', '', '', '', '', '', '', '', '', '', '',
    '', 'บริษัท แอดวานซ์  เอ็มเปย์ จำกัด', '915', '', '134102749920700', '9510029382172', '', '','',''
    ]
  },
}



